public class Main {
    public static void main(String[] args) {
        //описываем массив значений (16 вариаций)
        double[] x = new double[]
                {       1.0, 1.0, 1.0,
                        1.0, 0.8, 1.0,
                        1.0, 1.0, 1.25,
                        1.0, 0.8, 1.25,
                        1.0, 1.0, 1.0,
                        1.0, 0.8, 1.0,
                        1.0, 1.0, 1.25,
                        1.0, 0.8, 1.25,
                        1.4, 1.0, 1.0,
                        1.4, 0.8, 1.0,
                        1.4, 1.0, 1.25,
                        1.4, 0.8, 1.25,
                        1.2, 1.0, 1.0,
                        1.2, 0.8, 1.0,
                        1.2, 1.0, 1.25,
                        1.2, 0.8, 1.25};
        //запускаем функцию
        function(x);
    }
    //Функция вычисления значений
    public static void function(double[] x) {
        double f;
        //count - номер вариации
        int count=0;
        for (int i = 0; i < 48; i=i+3) {
            count++;
            f = 60.0/60.0*30.0/25.0*25.0/45.0*28.0/28.0*28.0/35.0*x[i]*18.0/45.0*x[i+1]*15.0/48.0*x[i+2]*12.0;
            System.out.println("f" + count + " = " + f);
        }
    }
}

